GigaDevice-GD32-MCU/GD32F470_EVAL_LVGL/Template/main.c
/*!
    \file    main.c
    \brief   GD32F470 LVGL demo

    \version 2016-08-15, V1.0.0, firmware for GD32F4xx
    \version 2018-12-12, V2.0.0, firmware for GD32F4xx
    \version 2020-09-30, V2.1.0, firmware for GD32F4xx
    \version 2022-03-09, V3.0.0, firmware for GD32F4xx
*/

/*
    Copyright (c) 2022, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f4xx.h"
#include <stdio.h>
#include "main.h"
/* system Config*/
#include "sys_config.h"
/* bsp*/
#include "bsp_adc.h"
#include "exmc_sdram.h"
#include "systick.h"
#include "gd32f470i_eval.h"
#include "gd32f450i_lcd_eval.h"

/* lvgl*/
#if SYS_configUSE_LVGL
    #include "lvgl.h"
    #include "lv_port_disp.h"
    #include "lv_port_indev.h"
    #include "lv_demos.h"
#endif
/* FatFs*/
#if SYS_configUSE_FAT32FS
    #include "ff.h"
    #include "fatfs_file_browse.h"
#endif

/* FreeRTOS*/
#if SYS_configUSE_FREERTOS
    #include "taskmain.h"
#endif

void lv_demo_app(void);

uint16_t back_to_home = 1;

float g_temperature;

/*!
    \brief    main function
    \param[in]  none
    \param[out] none
    \retval     none
*/

int main(void)
{
    systick_config();

    /* ADC configuration */
    adc_config();
    
#if SYS_configUSE_LVGL
    lv_init();
    lv_port_disp_init();
    lv_port_indev_init();
#endif

#if SYS_configUSE_FAT32FS
    lv_fs_fatfs_init();
    scanfiles_test();
#endif
    
 
#if SYS_configUSE_LVGL
    lv_demo_app();
#endif

#if SYS_configUSE_WATCHDOG
    dbg_periph_enable(DBG_FWDGT_HOLD);
    /* enable write access to FWDGT_PSC and FWDGT_RLD registers.
       FWDGT counter clock: 40KHz(IRC40K) / 64 = 0.625 KHz.
       FWDGT timeout is set to 1s (the timeout may varies due to 
                                   IRC40K frequency dispersion). */
    fwdgt_config(0xFFF, FWDGT_PSC_DIV256);
    fwdgt_enable();
#endif

#if SYS_configUSE_FREERTOS
    taskmainInit();
#endif
    
    while(1) {
#if !SYS_configUSE_FREERTOS
        delay_1ms(5);
#if SYS_configUSE_LVGL
        lv_task_handler();
#endif

#if SYS_configUSE_WATCHDOG
        fwdgt_counter_reload();
#endif
       /* value convert */
       g_temperature = Get_temperature();
#endif
    }
}

void __aeabi_assert(const char *ptr1, const char *ptr2, int val)
{
}
